{
  "id": "events-lead",
  "title": "Events Lead",
  "location": "New York, New York, United States",
  "description": "Lead Uniswap’s global event strategy, executing impactful experiences that amplify our brand, strengthen our reputation, and engage crypto communities worldwide.",
  "fullDescription": "Uniswap is looking for a bold, experienced Events Lead to elevate our team. In this role, you’ll craft our global strategy and execute unforgettable events with precision. From shaping Uniswap’s presence at selected industry moments to hosting signature branded experiences, you’ll ensure every event amplifies our narrative and propels our growth.",
  "responsibilities": [
    "Design Uniswap’s global event strategy, setting clear goals in support of company priorities.",
    "Plan and prioritize high-impact events aligned with marketing objectives, including community engagement and product adoption.",
    "Communicate event strategies clearly to leadership, aligning with product, comms, policy, and partnership roadmaps.",
    "Write compelling event briefs and execute engaging experiences for crypto enthusiasts.",
    "Lead execution across all aspects, including venue selection, logistics, branding, and guest experience.",
    "Collaborate with internal teams and external vendors to deliver top-tier events.",
    "Ensure strict adherence to brand values, budget management, and operational excellence.",
    "Create post-event reports, track performance metrics, and optimize future event strategies.",
    "Maintain relationships with key industry players, partners, and vendors to enhance Uniswap’s event presence."
  ],
  "requirements": {
    "mustHave": [
      "8+ years of experience in event management, experiential design, or production.",
      "Highly organized, detail-oriented, and experienced in managing global event strategies.",
      "Proven ability to execute complex events and brand experiences from concept to completion.",
      "Self-starter with excellent problem-solving skills, adaptable to fast-paced environments.",
      "Strong project management skills with expertise in budget control, logistics, and execution.",
      "Affinity for the crypto ecosystem and experience engaging DeFi communities."
    ],
    "niceToHave": [
      "Experience negotiating and executing large event/media partnerships.",
      "International event management experience and remote execution skills.",
      "Creative production experience with a focus on branding and digital media."
    ]
  },
  "compensation": {
    "remote": "Yes",
    "tokenRewards": "Earn $BASEBUZZ via on-chain staking & governance participation.",
    "benefits": [
      "Fully remote, async-first work environment.",
      "Access to exclusive DeFi tools and trading incentives.",
      "On-chain reputation tracking—build your Web3 work history.",
      "Staked governance power in BaseBuzz ecosystem apps."
    ]
  }
}
