{
  "id": "Senior-Backend-Engineer-Base-Chain",
  "title": "Senior Backend Engineer, Base Chain",
  "location": "Remote or US/EU-Based",
  "description": "Architect and scale the next-generation Base-native DeFi infrastructure, optimizing liquidity flows, smart contract execution, and on-chain governance.",
  "fullDescription": "BaseBuzz is at the forefront of AI-driven DeFi, integrating cutting-edge trading strategies, governance automation, and real-world asset tokenization on Base. We are expanding our on-chain capabilities and seeking an experienced Senior Backend Engineer to build the infrastructure that powers the future of decentralized finance. \n\nJoining BaseBuzz means working on high-performance backend systems that interact directly with Base, optimizing transactions, indexing on-chain data, and driving the development of key DeFi primitives.",
  "responsibilities": [
    "Develop and maintain backend infrastructure optimized for Base L2 and on-chain trading strategies.",
    "Design and implement high-performance, scalable systems that interact directly with Base smart contracts.",
    "Lead strategic technical initiatives to ensure the reliability and efficiency of BaseBuzz’s on-chain services.",
    "Own backend systems end-to-end—from architecture and deployment to monitoring and scaling.",
    "Ensure 24/7 uptime for mission-critical infrastructure, participating in on-call rotations for chain monitoring.",
    "Review and optimize smart contract execution flows, reducing gas costs and enhancing transaction reliability.",
    "Mentor junior engineers and onboard contributors into the Base ecosystem."
  ],
  "requirements": {
    "mustHave": [
      "5+ years of backend engineering experience, including 2+ years working on EVM-based chains.",
      "Strong experience in building high-scale backend services, particularly for DeFi or financial applications.",
      "Deep understanding of cloud infrastructure, distributed systems, and debugging complex backend architectures.",
      "Ability to design, build, and maintain scalable on-chain indexing and data infrastructure.",
      "Experience in developing, maintaining, and optimizing RPC endpoints and transaction execution services.",
      "Strong coding skills in TypeScript, Go, or Rust."
    ],
    "niceToHave": [
      "Hands-on experience contributing to an Optimism-based chain or other Layer 2 rollups.",
      "Solidity development experience and smart contract security best practices.",
      "Background in on-chain analytics, real-time indexing, or mempool monitoring.",
      "Experience with AWS or decentralized storage solutions for high-availability services.",
      "A passion for open-source DeFi innovation."
    ]
  },
  "compensation": {
    "remote": "Yes",
    "tokenRewards": "Earn $BASEBUZZ via on-chain staking & governance participation.",
    "benefits": [
      "Fully remote, async-first work environment.",
      "Access to exclusive DeFi tools and trading incentives.",
      "On-chain reputation tracking—build your Web3 work history.",
      "Staked governance power in BaseBuzz ecosystem apps."
    ]
  },
  "applyLink": "/careers/apply?role=senior-backend-engineer-base"
}
