{
  "id": "social-media-manager",
  "title": "Social Media Manager",
  "location": "Work where you want, when you want",
  "description": "Lead BaseBuzz's social media strategy, crafting narratives that drive engagement and community growth across Web3 platforms.",
  "fullDescription": "BaseBuzz is at the forefront of AI-powered DeFi, governance automation, and real-world asset tokenization. We are seeking a creative and self-motivated Social Media Manager to lead our content strategy, craft engaging narratives, and foster a strong community around BaseBuzz and its ecosystem, including Rugtron3000, MemePro, and JobsOnBase. \n\nThis role requires an expert-level understanding of crypto culture, DeFi, and Web3, with a track record of executing successful campaigns across multiple social media platforms. The ideal candidate will have experience blending thought leadership, product marketing, and memes to reach diverse audiences.",
  "responsibilities": [
    "Develop and execute a multi-platform social media strategy to engage DeFi traders, builders, and community members.",
    "Create high-quality, engaging content—including threads, memes, explainers, and announcements—for Twitter, Instagram, TikTok, and YouTube.",
    "Coordinate across product, marketing, design, and engineering teams to support go-to-market campaigns and community engagement.",
    "Maintain a consistent brand tone while adapting messaging to suit various audience segments within the BaseBuzz ecosystem.",
    "Engage with the Web3 and DeFi community, building relationships with key influencers, projects, and media outlets.",
    "Identify growth opportunities across platforms and optimize campaigns based on data-driven insights.",
    "Monitor and analyze engagement metrics to refine content strategies and maximize impact."
  ],
  "requirements": {
    "mustHave": [
      "3-5 years of experience running social media for a Web3, DeFi, or crypto-native brand or agency.",
      "Deep understanding of crypto culture, DeFi narratives, and Web3 trends.",
      "Proven track record of managing successful campaigns that balance education, engagement, and virality.",
      "Expertise in copywriting and brand voice development, with an ability to simplify complex topics.",
      "Experience using analytics tools (e.g., Sprout Social, Twitter Analytics) to measure and refine content performance.",
      "Ability to craft visually appealing posts using basic design tools (Canva, Figma, Photoshop)."
    ],
    "niceToHave": [
      "Experience creating and editing short-form video content for TikTok, YouTube Shorts, and Instagram Reels.",
      "Familiarity with on-chain social media platforms and decentralized content distribution.",
      "Previous experience working with DAOs or decentralized communities.",
      "Love for unicorns 🦄"
    ]
  },
  "compensation": {
    "remote": "Yes",
    "tokenRewards": "Earn $BASEBUZZ via on-chain staking & governance participation.",
    "benefits": [
      "Fully remote, async-first work environment.",
      "Deep integration with DeFi communities and exclusive governance incentives.",
      "On-chain reputation tracking—build your Web3 work history.",
      "Access to exclusive BaseBuzz ecosystem perks and staking rewards."
    ]
  },
  "applyLink": "/careers/apply?role=social-media-manager"
}
