{
  "id": "community-lead",
  "title": "Community Lead",
  "location": "Work where you want, when you want",
  "description": "Engage, grow, and manage the BaseBuzz community across social platforms, Discord, and DeFi networks. Drive conversations, host events, and foster a thriving Web3 ecosystem.",
  "fullDescription": "BaseBuzz is building the future of AI-powered DeFi, governance automation, and RWA tokenization. As our Community Lead, you will shape and drive the voice of our brand, engaging directly with traders, devs, and builders across the ecosystem.\n\nThis is a high-impact role that requires deep familiarity with DeFi, Base ecosystem projects, and decentralized governance. You will oversee BaseBuzz’s online presence, create engagement strategies, host AMAs, and turn community excitement into long-term growth.",
  "responsibilities": [
    "Manage BaseBuzz’s online presence across Discord, Twitter, Farcaster, and other Web3 platforms.",
    "Develop and execute community engagement strategies, including giveaways, challenges, and DeFi trading incentives.",
    "Host and moderate community calls, Twitter Spaces, and AMAs with key industry figures.",
    "Stay on top of DeFi trends and Base ecosystem developments, driving discussions and thought leadership.",
    "Support developers and traders using BaseBuzz’s dApps (Rugtron3000, MemePro, JobsOnBase).",
    "Create educational content, including explainer threads, FAQs, and video snippets for onboarding new users.",
    "Collaborate with the partnerships and growth teams to amplify BaseBuzz’s ecosystem presence.",
    "Develop and manage a global team of community moderators.",
    "Ensure timely responses to community inquiries, maintaining a strong support presence across platforms."
  ],
  "requirements": {
    "mustHave": [
      "Experience managing Web3 or DeFi communities across Discord, Twitter, and on-chain social platforms.",
      "Strong understanding of Base ecosystem, AI-driven DeFi, and decentralized governance.",
      "Ability to translate complex DeFi concepts into clear, engaging content.",
      "Self-directed, highly organized, and capable of managing a fast-moving community.",
      "Passion for crypto, DAOs, and meme culture.",
      "Excellent communication skills and a strong online presence in Web3 circles."
    ],
    "niceToHave": [
      "Technical knowledge of EVM-based DeFi protocols and smart contract mechanisms.",
      "Experience growing and scaling an online crypto community from scratch.",
      "Connections with key Base influencers, developers, and DeFi traders.",
      "History of running large-scale online events, AMAs, and governance proposals.",
      "Fondness for the color blue and love for degen trading 🦄"
    ]
  },
  "compensation": {
    "remote": "Yes",
    "tokenRewards": "Earn $BASEBUZZ via staking, governance, and community growth incentives.",
    "benefits": [
      "Fully remote, async-friendly role with global impact.",
      "Exclusive access to governance voting and project influence.",
      "On-chain reputation tracking—build your Web3 work history.",
      "Early access to new BaseBuzz dApps and integrations."
    ]
  },
  "applyLink": "/careers/apply?role=community-lead"
}
